app/controllers/jsons_controller.rb

  def index
    @jsons = Json.all
---
SELECT "jsons".* FROM "jsons"

  def save

    @json=Json.new(json_params)
    byebug
    #@json.filename=params["json"]["filename"]
    #@json.content_type=params["json"]["content_type"]
    #@json.file_contents=params["json"]["file_contents"]
    #@json.objekt=params["json"]["objekt"]
    respond_to do |format|
      if @json.save
---
INSERT INTO "jsons" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-09-07 12:56:00.087025"], ["updated_at", "2017-09-07 12:56:00.087025"]]

  def destroy
    @json.destroy
---
DELETE FROM "jsons" WHERE "jsons"."id" = ?  [["id", 1]]

    def set_json
      @json = Json.find(params[:id])
---
SELECT  "jsons".* FROM "jsons" WHERE "jsons"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]